[{"@context":"http://schema.org","@type":"Recipe","mainEntityOfPage":true,"name":"Crispy Treat Witch's Hat","url":"https://www.foodnetwork.com/recipes/food-network-kitchen/crispy-treat-witchs-hat-3885544","headline":"Crispy Treat Witch's Hat","description":"Get crafty with this edible witch's hat: chocolate-flavored rice cereal, green food coloring and edible gold dust transform ordinary crispy rice treats into a sweet Halloween centerpiece.","author":[{"@type":"Person","name":"Food Network Kitchen","url":"https://www.foodnetwork.com/profiles/talent/food-network-kitchen"}],"image":{"@type":"ImageObject","url":"https://food.fnr.sndimg.com/content/dam/images/food/fullset/2016/6/29/0/FN_schaeffer-platters-Witches-Hat_s4x3.jpg.rend.hgtvcom.406.305.suffix/1507579309559.jpeg","height":"406","width":"305"},"datePublished":"2017-09-28T14:11:53.840-04:00","dateModified":"2017-09-28T14:11:53.521-04:00","publisher":{"@type":"Organization","name":"Food Network","url":"https://www.foodnetwork.com","logo":{"@type":"ImageObject","url":"https://food.fnr.sndimg.com/etc/clientlibs/assets/images/food/fn-logo-flat-60x60.png","height":"60","width":"60"}},"keywords":"Cereal,Dessert","cookTime":"P0Y0M0DT0H40M0.000S","totalTime":"P0Y0M0DT1H0M0.000S","recipeIngredient":["12 tablespoons (1 1/2 sticks) unsalted butter, plus more for buttering the parchment and bowl","Four 10-ounce packages marshmallows","Two 15.5-ounce boxes chocolate-flavored rice cereal","Dash cocoa powder, optional","Vegetable oil, for oiling your hands","One 12-ounce box plain rice cereal","Green gel food coloring, for coloring the cereal mixture","Edible gold powder, for dusting the cereal mixture"],"recipeInstructions":[{"@type":"HowToStep","text":"Melt 9 tablespoons of the butter in a large pot over low heat. Add 3 packages marshmallows and heat, stirring, until completely melted. Add the chocolate-flavored rice cereal and stir until well coated. The mixture will look very white because of the melted marshmallow; that's okay because the color will fade. You can add a dash of cocoa powder to deepen the color if you'd like."},{"@type":"HowToStep","text":"For the hat base: Grease a large piece of parchment with butter. Oil your hands so the cereal doesn't stick, then remove about a quarter of the cereal mixture. Press and mold the mixture on the greased parchment to create a 10-inch flat circle. "},{"@type":"HowToStep","text":"For the hat: Build the remaining cereal mixture into a cone with a 6-inch-wide base. Set the cone on top of the hat base. Shape bends and divots into the cone to make a realistic looking hat."},{"@type":"HowToStep","text":"Melt the remaining 3 tablespoons butter in a saucepan over low heat. Add the remaining package of marshmallows and heat, stirring, until melted. Stir in the plain rice cereal until well coated. Grease a small bowl with butter and transfer 1/2 cup of the cereal mixture to the bowl. Set aside."},{"@type":"HowToStep","text":"For the hatband: Add a few drops of green gel food coloring to the rest of the cereal mixture in the saucepan and mix well until the color is even. Using the green batch, create a 3-inch-wide band or strip to wrap around the entire base of the cone. "},{"@type":"HowToStep","text":"For the buckle: Dust the reserved batch of cereal mixture with edible gold powder and shape into a square buckle. Press the buckle onto the base of the hatband. If the mixture doesn't hold its shape, let it set for 10 minutes to stiffen. "}],"recipeYield":"14 to 16 servings","recipeCategory":"dessert"}, {"@context":"http://schema.org","@type":"BreadcrumbList","itemListElement":[{"@type":"ListItem","position":1,"item":{"@id":"https://www.foodnetwork.com","name":"Home"}},{"@type":"ListItem","position":2,"item":{"@id":"https://www.foodnetwork.com/recipes","name":"Recipes"}}]}]